mhmtsui/chipKIT-core/pic32/cores/pic32/HardwareSerial.cpp
/* ------------------------------------------------------------ */
/***	HardwareSerial::write
**
**	Parameters:
**		theChar		- the character to transmit
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Wait until the transmitter is idle, and then transmit the
**		specified character.
*/

size_t HardwareSerial::write(uint8_t theChar)
{

	while ((uart->uxSta.reg & (1 << _UARTSTA_UTXBF)) != 0)	//check the UTXBF bit
    {
		//* wait for the transmitter buffer to have room
	}

	uart->uxTx.reg = theChar;
    if (txIntr != NULL){
        iec->set = bit_tx + bit_rx; //enable tx interrupt
    }
    return 1;
}

size_t HardwareSerial::write(const uint8_t *buffer, size_t size) {
    size_t n = 0;
    while (size--) {
        while ((uart->uxSta.reg & (1 << _UARTSTA_UTXBF)) != 0)	//check the UTXBF bit
        {
                //* wait for the transmitter buffer to have room
        }
        uart->uxTx.reg = (*buffer++);
        n += 1;
    }
    if (txIntr != NULL){
        iec->set = bit_tx + bit_rx; //enable tx interrupt
    }
    return n;
}

size_t HardwareSerial::write(const char *str) {
    if (str == NULL) return 0;
    return write((const uint8_t *)str, strlen(str));
}

void HardwareSerial::write_async(uint8_t * buffer, size_t size){
    if (_dmatxchn != -1){
        //iec->set = bit_tx; //enable tx interrupt
        DMAC_ChannelTransfer((DMAC_CHANNEL)_dmatxchn, (const void *)buffer, size, (const void *)&(uart->uxTx.reg), 1, 1);
        DMAC_ChannelForceStart((DMAC_CHANNEL)_dmatxchn);
    }
}

void HardwareSerial::read_async(uint8_t * buffer, size_t size){
    if (_dmarxchn != -1){
        DMAC_ChannelTransfer((DMAC_CHANNEL)_dmarxchn,(const void *)&(uart->uxRx.reg), 1, (const void *)buffer, size, 1);
        //DMAC_ChannelForceStart((DMAC_CHANNEL)_dmarxchn);
    }
}

// Hardware serial has a buffer of length 1
int HardwareSerial::availableForWrite() {
    if (uart->uxSta.reg & (1 << _UARTSTA_UTXBF)) {
        return 0;
    }
    else {
        return 1;
    }
}

// Hardware serial is always connected regardless.
HardwareSerial::operator int() {
    return 1;
}

static void ReceiveCompleteCallback(DMAC_TRANSFER_EVENT event, uintptr_t contextHandle){
    HardwareSerial * h = (HardwareSerial *) contextHandle;
    if (h->asyncrxIntr != NULL){
        h->asyncrxIntr();
    }
}

static void TransmitCompleteCallback(DMAC_TRANSFER_EVENT event, uintptr_t contextHandle){
    HardwareSerial * h = (HardwareSerial *) contextHandle;
    if (h->asynctxIntr != NULL){
        h->asynctxIntr();
    }
}

/* ------------------------------------------------------------ */
/***	HardwareSerial::doSerialInt
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		This function is called by the interrupt service routine
**		for the UART being used by this object. It's purpose is
**		to process receive interrupts and place the received
**		characters into the receive buffer.
*/

void HardwareSerial::doSerialInt(void)
{
	int		bufIndex;
	uint8_t	ch;

	/* If it's a receive interrupt, get the character and store
	** it in the receive buffer.
	*/
	if ((ifs->reg & bit_rx) != 0)
	{
		ch = uart->uxRx.reg;
        if (rxIntr != NULL) {
            /* If we have had an interrupt callback routine defined then call
            ** that instead of adding the character to the queue. Pass the
            ** received character to the function for processing.
            */
            rxIntr(ch);
        } else {
            bufIndex	= (rx_buffer.head + 1) % RX_BUFFER_SIZE;
        
            /* If we should be storing the received character into the location
            ** just before the tail (meaning that the head would advance to the
            ** current location of the tail), we're about to overflow the buffer
            ** and so we don't write the character or advance the head.
            */
            if (bufIndex != rx_buffer.tail)
            {
                rx_buffer.buffer[rx_buffer.head] = ch;
                rx_buffer.head = bufIndex;
            }
        }

		/* Clear the interrupt flag.
		*/
		ifs->clr = bit_rx;
	}

	/* If it's a transmit interrupt, ignore it, as we don't current
	** have interrupt driven i/o on the transmit side.
	*/
	if ((ifs->reg & bit_tx) != 0)
	{
        if (uart->uxSta.reg & (1 << _UARTSTA_TMRT)){
            if (txIntr != NULL){
                txIntr();
            }
            // disable the tx interrupt
            iec->clr = bit_tx;
            iec->set = bit_rx;
        }
		/* Clear the interrupt flag.
		*/
		ifs->clr = bit_tx;
	}

}

void HardwareSerial::doAsyncSerialInt(void)
{
	//int		bufIndex;
	//uint8_t	ch;

	/* If it's a receive interrupt, get the character and store
	** it in the receive buffer.
	*/
	if ((ifs->reg & bit_rx) != 0)
	{
		// ch = uart->uxRx.reg;
        //if (rxIntr != NULL) {
            /* If we have had an interrupt callback routine defined then call
            ** that instead of adding the character to the queue. Pass the
            ** received character to the function for processing.
            */
        //    rxIntr(0);
        //} 
        //else {
        //     bufIndex	= (rx_buffer.head + 1) % RX_BUFFER_SIZE;
        
        //     /* If we should be storing the received character into the location
        //     ** just before the tail (meaning that the head would advance to the
        //     ** current location of the tail), we're about to overflow the buffer
        //     ** and so we don't write the character or advance the head.
        //     */
        //     if (bufIndex != rx_buffer.tail)
        //     {
        //         rx_buffer.buffer[rx_buffer.head] = ch;
        //         rx_buffer.head = bufIndex;
        //     }
        // }

		/* Clear the interrupt flag.
		*/
		ifs->clr = bit_rx;
	}

	/* If it's a transmit interrupt, ignore it, as we don't current
	** have interrupt driven i/o on the transmit side.
	*/
	if ((ifs->reg & bit_tx) != 0)
	{
        if (uart->uxSta.reg & (1 << _UARTSTA_TMRT)){
            // if (txIntr != NULL){
            //     txIntr();
            // }
            // disable the tx interrupt
            iec->clr = bit_tx;
            iec->set = bit_rx;
        }
		/* Clear the interrupt flag.
		*/
		ifs->clr = bit_tx;
	}

