mhmtsui/chipKIT-core/pic32/cores/pic32/HardwareSerial.cpp
}

void HardwareSerial::attachasyncrxInterrupt(void (*callback)(void)) {
    asyncrxIntr = callback;
}

void HardwareSerial::attachasynctxInterrupt(void (*callback)(void)) {
    asynctxIntr = callback;
}

void HardwareSerial::attachtxInterrupt(void (*callback)(void)) {
    txIntr = callback;
}

/* Attach the interrupt by storing a function pointer in the rxIntr variable */
void HardwareSerial::attachInterrupt(void (*callback)(int)) {
    rxIntr = callback;
}

/* Detatching the interrupt is as simple as setting the rxIntr to null. */
void HardwareSerial::detachInterrupt() {
    rxIntr = NULL;
    txIntr = NULL;
}

/* Sets the bit in the UART status register that enables address detection */
void HardwareSerial::enableAddressDetection(void) {
    uart->uxSta.set = 1 << _UARTSTA_ADDEN;
}

/* Clears the bit in the UART status register that enables address detection */
void HardwareSerial::disableAddressDetection(void) {
    uart->uxSta.clr = 1 << _UARTSTA_ADDEN;
}

/* ------------------------------------------------------------ */
/*			UART Interrupt Service Routines						*/
/* ------------------------------------------------------------ */

//*	we need the extern C so that the interrupt handler names don't
//* get mangled by C++

extern "C" {

/* ------------------------------------------------------------ */
/***	IntSer0Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 0.
*/
#if defined(_SER0_VECTOR)

void __USER_ISR IntSer0Handler(void)
{
#if defined(__SERIAL_IS_USB__)
	Serial0.doSerialInt();
#else
	Serial.doSerialInt();
#endif
}

void __USER_ISR IntAsyncSer0Handler(void)
{
#if defined(__SERIAL_IS_USB__)
	Serial0.doAsyncSerialInt();
#else
    Serial.doAsyncSerialInt();
#endif
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer1Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 1.
*/
#if defined(_SER1_VECTOR)
void __USER_ISR IntSer1Handler(void)
{
	Serial1.doSerialInt();
}
void __USER_ISR IntAsyncSer1Handler(void)
{
	Serial1.doAsyncSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer2Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 2.
*/
#if defined(_SER2_VECTOR)
void __USER_ISR IntSer2Handler(void)
{
	Serial2.doSerialInt();
}

void __USER_ISR IntAsyncSer2Handler(void)
{
	Serial2.doAsyncSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer3Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 3.
*/
#if defined(_SER3_VECTOR)
void __USER_ISR IntSer3Handler(void)
{
	Serial3.doSerialInt();
}

void __USER_ISR IntAsyncSer3Handler(void)
{
	Serial3.doAsyncSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer4Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 4.
*/
#if defined(_SER4_VECTOR)
void __USER_ISR IntSer4Handler(void)
{
	Serial4.doSerialInt();
}

void __USER_ISR IntAsyncSer4Handler(void)
{
	Serial4.doAsyncSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer5Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 5.
*/
#if defined(_SER5_VECTOR)
void __USER_ISR IntSer5Handler(void)
{
	Serial5.doSerialInt();
}
void __USER_ISR IntAsyncSer5Handler(void)
{
	Serial5.doAsyncSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer6Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 6.
*/
#if defined(_SER6_VECTOR)
void __USER_ISR IntSer6Handler(void)
{
	Serial6.doSerialInt();
}

void __USER_ISR IntAsyncSer6Handler(void)
{
	Serial6.doAsyncSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer7Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 7.
*/
#if defined(_SER7_VECTOR)
void __USER_ISR IntSer7Handler(void)
{
	Serial7.doSerialInt();
}

void __USER_ISR IntAsyncSer7Handler(void)
{
	Serial7.doAsyncSerialInt();
}
#endif

};	// extern C

/* ------------------------------------------------------------ */
/*			Serial Port Object Instances						*/
/* ------------------------------------------------------------ */

#if defined(__SERIAL_IS_USB__)
/* If we're using USB for serial, the USB serial port gets
** instantiated as Serial and hardware serial port 0 gets
** instantiated as Serial0.
*/
bool Serial_available() { return Serial.available(); }
#if defined(_SER0_BASE)
bool Serial0_available() { return Serial0.available(); }
#if defined(__PIC32_PPS__)
HardwareSerial Serial0((p32_uart *)_SER0_BASE, _SER0_IRQ, _SER0_VECTOR, _SER0_IPL, _SER0_SPL, IntSer0Handler, IntAsyncSer0Handler, _SER0_TX_PIN, _SER0_RX_PIN, _SER0_TX_OUT, _SER0_RX_IN);
#else
HardwareSerial Serial0((p32_uart *)_SER0_BASE, _SER0_IRQ, _SER0_VECTOR, _SER0_IPL, _SER0_SPL, IntSer0Handler, IntAsyncSer0Handler);
#endif
#endif

#else
/* If we're not using USB for serial, then hardware serial port 0
** gets instantiated as Serial.
** NOTE: PIC32MX1xx/2xx devices only have 2 UARTS, so we're not defining more variant
** object instances for those devices.
** however MZ have 6
*/
#if defined(_SER0_BASE)
bool Serial_available() { return Serial.available(); }
#if defined(__PIC32_PPS__)
HardwareSerial Serial((p32_uart *)_SER0_BASE, _SER0_IRQ, _SER0_VECTOR, _SER0_IPL, _SER0_SPL, IntSer0Handler, IntAsyncSer0Handler, _SER0_TX_PIN, _SER0_RX_PIN, _SER0_TX_OUT, _SER0_RX_IN);
#else
HardwareSerial Serial((p32_uart *)_SER0_BASE, _SER0_IRQ, _SER0_VECTOR, _SER0_IPL, _SER0_SPL, IntSer0Handler, IntAsyncSer0Handler);
#endif
#endif

#endif	//defined(_USB) && defined(_USE_USB_FOR_SERIAL_)

#if defined(_SER1_BASE)
bool Serial1_available() { return Serial1.available(); }
#if defined(__PIC32_PPS__)
HardwareSerial Serial1((p32_uart *)_SER1_BASE, _SER1_IRQ, _SER1_VECTOR, _SER1_IPL, _SER1_SPL, IntSer1Handler, IntAsyncSer1Handler, _SER1_TX_PIN, _SER1_RX_PIN, _SER1_TX_OUT, _SER1_RX_IN);
#else
HardwareSerial Serial1((p32_uart *)_SER1_BASE, _SER1_IRQ, _SER1_VECTOR, _SER1_IPL, _SER1_SPL, IntSer1Handler, IntAsyncSer1Handler);
#endif
#endif

